using System;

namespace ConsoleApp57
{
    internal class Program
    {
        static void Main(string[] args)
        {
            //static (Справочник по C#)- На этой странице приводятся сведения о ключевом слове модификатора static
            //Статические классы и члены статических классов (Руководство по программированию в C#) - это класси к которым нельзая применить new тоесть создать екземпляр
            //Вложенные типы (Руководство по программированию на C#) - Тип, определенный внутри класса, структуры или интерфейса
            //
            //
            //
        }
    }
}
